{"201":{"tags":["Mobile","Management"],"speakers":["gianluca_segato"],"title":"Don't do native if you want VC money!","videoId":"","language":"English","description":"All of us heard about this magical creature living in the product space called MVP. Or at least we've heard some manager babbling about it. In this talk, we'll discuss the key tech requirements of a Minimum Viable Product, from metrics drivers to fast delivery, in relation to what investors usually look for when evaluating a startup. We will then discover why native development, when viewed through the lens of cost-benefit ratio, is most of the time not the best tech-stack to choose if you're building a blitzscaling company from the group up – and why cross-platform frameworks like Flutter are. Finally, we'll go through technical debt as well and what it means if you're raising a new funding round, as it is the natural downside of not going native since day 0.","presentation":"","complexity":"Beginner"},"202":{"videoId":"","language":"English","description":"You often have to create asynchronous code while developing Flutter applications. To do this effectively, essential steps are understanding the event loop, basics of Futures and Streams, async/await, async* and yield keywords and learning about a number of helper classes. Furthermore, there are a number of common patterns that arise while creating asynchronous code that is interactive. In this talk, even if you never wrote asynchronous code before, you will understand the concept, the tools and the patterns that will be useful in your asynchronous programming journey. This should help you become a better Flutter developer. ","presentation":"","complexity":"Intermediate","tags":["Mobile"],"speakers":["gazihan_alankus"],"title":"Improve Your Asynchronous Code in Flutter"},"203":{"tags":["Cloud","Machine Learning"],"speakers":["ines_huertas_freire"],"title":"Deployment Tensorflow Models over Google Cloud","language":"English","videoId":"","description":"During the talk we will see a small evolution of how we can put models into production, from generating API points with R models to one of the simplest solutions using Tensorflow with Google Cloud","presentation":"","complexity":"Intermediate"},"204":{"title":"Google Cast, when one screen is not enough","language":"English","videoId":"","description":"When we develop mobile apps or websites, our users can interact with them using a large selection of displays, but there is one that is often ignored: the TV one. In this talk I'll give and introduction to Google Cast, seeing how it can be used to to create a more central, prominent space for the most important content of your service. ","presentation":"","complexity":"Beginner","tags":["Mobile","Web"],"speakers":["daniele_bonaldo"]},"205":{"tags":["Managment"],"speakers":["michel_murabito"],"title":"Manage Teams, a space adventure!","language":"English","videoId":"","description":"Managing un team è complesso, alcune volte sembra quasi di essere soli durante l’esplorazione spaziale! Ma nessun grande lavoro può essere fatto senza un grande team. “Da grandi team grandi responsabilità”, non era proprio così… Ma cosa dovresti fare per aiutare il tuo gruppo a raggiungere gli obiettivi? E quali pratiche sane dovresti introdurre per rendere il luogo di lavoro, un pò, migliore?","presentation":"","complexity":"Intermediate"},"206":{"tags":["Cloud","Web"],"speakers":["vasudev_maduri"],"title":"A brave new world. \"Serverless\" computing on Google Cloud.","videoId":"","language":"English","description":"Millions of people swap selfies on Snapchat or play Super Mario Run every day. Do you know where these apps are running? It's the venerable Google App Engine and the infrastructure of Google Cloud that allow developers to focus on their code and let it scaler the application to Google. Whether you are deploying applications with App Engine, or functions with Cloud Functions, you no longer worry about servers or clusters to provision and you pay proportionately for usage, with no fixed costs. In this session, let's find out together what's under the hood, and especially Google's new \"serverless\" beyond App Engine and Cloud Functions.","presentation":"","complexity":"Intermediate"},"232":{"icon":"registration","title":"Registration","image":"https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fregistration.jpg?alt=media&token=27328646-d323-4cca-904c-75f021bc3ffe","description":"Get your badge, coffee, enjoy talking with tech edicts around"},"233":{"description":"Foooooooood!","icon":"lunch","title":"Lunch","image":"https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Flunch.jpg?alt=media&token=bc82aaff-92cc-4dcc-a00e-2b6f30a40225"},"234":{"title":"Coffee break","image":"https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fcoffee-break.jpg?alt=media&token=7c2c929b-cb94-4be8-a05a-b3f678136cb7","description":"Coffeeeeeee!","icon":"coffee-break"},"236":{"language":"English","description":"Official start of the conference. Greetings from the organizers, sponsors and partners.","icon":"opening","title":"GDG DevFest Ukraine 2016 Opening","image":"https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fopening.jpg?alt=media&token=aa52dd45-50c9-4e36-9485-c1f9138ecd6b"},"238":{"title":"Conference closing and contest winners announcements","image":"https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fclosing.jpg?alt=media&token=f02d014a-09ee-407e-88c7-b74093e00fed","description":"Make sure you won't miss closing ceremony, all gifts from out sponsors and partners will find their owners during this session."}}